@arjunchauhanibm - from Paul:

Yes for sure :
 
Cloudlogs CRN: crn:v1:bluemix:public:logs:eu-fr2:a/25b3da79dc9a4843a414c87d618bc357:8eb1fa13-aac1-479a-9225-498c8651a5f5::
CIS Instance: crn:v1:bluemix:public:internet-svcs:global:a/25b3da79dc9a4843a414c87d618bc357:63c73ec7-5811-4406-ac56-f1384cc98683::
CIS Domain: env1-test.iz.sandbox-cloud.net
 
Terraform template (extract):
 
```hcl
resource "ibm_cis_logpush_job" "this" {
  depends_on      = [null_resource.enabling_log_retention]
  cis_id          = ibm_cis.this.id
  domain_id       = ibm_cis_domain.this.id
  name            = "${var.prefix}-cis-logpush"
  enabled         = true
  logpull_options = var.default_log_push_config["logpull_options"]
  dataset         = var.default_log_push_config["dataset"]
  frequency       = var.default_log_push_config["frequency"]
  ibmcl {
    instance_id = data.ibm_resource_instance.logging_instance.guid
    api_key     = ibm_iam_service_api_key.this_sid_apikey.apikey
    region      = var.region
  }
}
```
 
Here is the plan:
 
```hcl
+ resource "ibm_cis_logpush_job" "this" {
   + cis_id           = "crn:v1:bluemix:public:internet-svcs:global:a/25b3da79dc9a4843a414c87d618bc357:63c73ec7-5811-4406-ac56-f1384cc98683::"
   + dataset          = "http_requests"
   + destination_conf = (known after apply)
   + domain_id        = (known after apply)
   + enabled          = true
   + error_message    = (known after apply)
   + frequency        = "high"
   + id               = (known after apply)
   + job_id           = (known after apply)
   + last_complete    = (known after apply)
   + last_error       = (known after apply)
   + logpull_options  = "fields=ClientIP,ClientRequestHost,ClientRequestMethod,ClientRequestURI,EdgeEndTimestamp,EdgeResponseBytes,EdgeResponseStatus,EdgeStartTimestamp&timestamps=rfc3339"
   + name             = "env1-test-cis-logpush"
   + ibmcl {
       + api_key     = (sensitive value)
       + instance_id = "8eb1fa13-aac1-479a-9225-498c8651a5f5"
       + region      = "eu-fr2"
     }
}
```
 